widthとheightの値の設定について

# 概要
widthとheightプロパティの値の指定方法についてまとめる。

# 指定方法
widthとheightには以下の指定方法がある。
- auto
- px
- %
- vw
- vh
- vmin
- vmax
## auto
初期値。
状況に応じて自動で設定する。
ブラウザに依存する。
## px
ピクセル単位で指定する。
実際の表示はモニタの解像度に依存する。
## %
親要素に対して割合で指定する。
## vw vh vmin vmax
vw: viewportの幅に対する割合
vh: viewportの高さに対する割合
vmin: vwとvhのうち小さい値に対する割合
vmax: vwとvhのうち大きい値に対する割合
これらの先頭のvはviewportを意味する。

### %とvh/vwの違い
%は親の要素のそれに依存する。
そのため、親の要素の値がviewportと同じときは%を使うことと同じになる。

### viewport指定の使い道
親の要素のwidth/height値がvw/vhと異なる場合に便利である。
そのような使い道としては、画面一杯の高さに広がるレイアウト等が考えられる。
%指定と異なり親の値に左右されないため、
そういったレイアウトが行いやすい。
